STMicroelectronics/OpenOCD/src/flash/nor/spc582b.c
		err = spc582b_setlock(bank, C55_BLOCK_MID, (lock_state & 0xFFFFFFFC));
		if (err != ERROR_OK)
			return err;
	}

	if (high_mask != 0) {
		err = spc582b_getlock(bank, C55_BLOCK_HIGH, &lock_state);
		if (err != ERROR_OK)
			return err;

		err = spc582b_setlock(bank, C55_BLOCK_HIGH, (lock_state & 0xFFFFFFF0));
		if (err != ERROR_OK)
			return err;
	}

	if (nLargeBlockSelect.firstLargeBlockSelect != 0) {
		err = spc582b_getlock(bank, C55_BLOCK_LARGE_FIRST, &lock_state);
		if (err != ERROR_OK)
			return err;

		err = spc582b_setlock(bank, C55_BLOCK_LARGE_FIRST, (lock_state & 0xFFFFFF00));
		if (err != ERROR_OK)
			return err;

		firstLargeBlockSelect = nLargeBlockSelect.firstLargeBlockSelect;

		nLargeBlockSelect.firstLargeBlockSelect = fast_target_buffer_get_u32((uint32_t *)&firstLargeBlockSelect, false);
	}

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _c55_ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};


	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
		return err;


	/* Flash erase code */
	if (target_alloc_working_area(target, sizeof(spc58x_flash_erase_code),
			&erase_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash erase step");
		target_free_working_area(target, ssd_config);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, erase_algorithm->address,
			sizeof(spc58x_flash_erase_code), (uint8_t *)spc58x_flash_erase_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, erase_algorithm);
		return err;
	}

	/* ssd_config (in), return value (out) */
	init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
	buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

	/* eraseOption C55_ERASE_MAIN (0x0) */
	init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
	buf_set_u32(reg_params[1].value, 0, 32, 0);

	/* lowBlockSelect */
	init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
	buf_set_u32(reg_params[2].value, 0, 32, low_mask);

	/* midBlockSelect */
	init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
	buf_set_u32(reg_params[3].value, 0, 32, mid_mask);

	/* highBlockSelect */
	init_reg_param(&reg_params[4], "r7", 32, PARAM_IN);
	buf_set_u32(reg_params[4].value, 0, 32, high_mask);

	/* nLargeBlockSelect */
	if (target_alloc_working_area(target, 8,
			&erase_working_area) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do get lock working area allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

//	h_u32_to_be((uint8_t *)nLargeBlockSelect_array, nLargeBlockSelect.firstLargeBlockSelect);
//	h_u32_to_be((uint8_t *)&nLargeBlockSelect_array[4], nLargeBlockSelect.secondLargeBlockSelect);

	err = target_write_buffer(target, erase_working_area->address,
			8, (uint8_t *)&nLargeBlockSelect);
	if (err != ERROR_OK)
		return err;

	init_reg_param(&reg_params[5], "r8", 32, PARAM_IN);
	buf_set_u32(reg_params[5].value, 0, 32, erase_working_area->address);


	/*
	 * Link register (in).
	 * Set link register to the breakpoint instruction at the end of the buffer.
	 * We use a software breakpoint to notify when done with algorithm execution.
	 */
	init_reg_param(&reg_params[6], "lr", 32, PARAM_IN);
	buf_set_u32(reg_params[6].value, 0, 32, erase_algorithm->address + (sizeof(spc58x_flash_erase_code) - 2));

	init_reg_param(&reg_params[7], "r1", 32, PARAM_IN);
	buf_set_u32(reg_params[7].value, 0, 32, target->working_area_phys + target->working_area_size - 1);


	err = target_run_algorithm(target,
			0, NULL,
			8, reg_params,
			erase_algorithm->address, (erase_algorithm->address + erase_algorithm->size),
			5000, &powerpc_info);

	if ((err != ERROR_OK) || (buf_get_u32(reg_params[0].value, 0, 32) != 0)) {
		err = ERROR_TARGET_FAILURE;

		target_free_working_area(target, erase_algorithm);
		target_free_working_area(target, erase_working_area);

		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
		destroy_reg_param(&reg_params[6]);
		destroy_reg_param(&reg_params[7]);
		goto flash_erase_error;
	}

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);
	destroy_reg_param(&reg_params[3]);
	destroy_reg_param(&reg_params[4]);
	destroy_reg_param(&reg_params[5]);
	destroy_reg_param(&reg_params[6]);
	destroy_reg_param(&reg_params[7]);

/* Check Status */
	opResult=0;
	opReturn=C55_INPROGRESS;

	/* Flash checkStatus code */
	if (target_alloc_working_area(target, sizeof(spc58x_flash_CheckStatus_code),
				&checkStatus_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash check status during erase step");
		target_free_working_area(target, ssd_config);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, checkStatus_algorithm->address,
				sizeof(spc58x_flash_CheckStatus_code), (uint8_t *)spc58x_flash_CheckStatus_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, checkStatus_algorithm);

		target_free_working_area(target, erase_algorithm);
		target_free_working_area(target, erase_working_area);
		return err;
	}

	/* CtxData */
	if (target_alloc_working_area(target, sizeof(struct _c55_context_data),
			&checkStatus_working_area_CtxData) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do get lock working area allocation");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, checkStatus_algorithm);

		target_free_working_area(target, erase_algorithm);
		target_free_working_area(target, erase_working_area);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	/* opResult */
	if (target_alloc_working_area(target, 8,
			&checkStatus_working_area) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do get lock working area allocation");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, checkStatus_algorithm);

		target_free_working_area(target, erase_algorithm);
		target_free_working_area(target, erase_working_area);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	while (opReturn == C55_INPROGRESS)
	{
		/* ssd_config (in), return value (out) */
		init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
		buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

