STMicroelectronics/OpenOCD/src/flash/nor/spc582b.c
		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc582b_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 4, 16 * 1024);
		setup_sector(bank, 4, 2, 32 * 1024);
		setup_sector(bank, 6, 2, 64 * 1024);

		// Large Flash Blocks
		setup_sector(bank, 8, 6, 128 * 1024);

		spc582b_info->low_max_index = 8;
		spc582b_info->large_max_index = 14;
		spc582b_info->high_max_index = 0;
		spc582b_info->mid_max_index = 0;
	}
	else if(bank->base == 0x800000)
	{
		num_pages = 4;

		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc582b_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 4, 16 * 1024);

		spc582b_info->low_max_index = 0;
		spc582b_info->large_max_index = 0;
		spc582b_info->high_max_index = 4;
		spc582b_info->mid_max_index = 0;
	}



	for (i = 0; i < num_pages; i++) {
		bank->sectors[i].is_erased = -1;
		bank->sectors[i].is_protected = 0;
	}

	/* Done */
	spc582b_info->probed = 1;


flash_init_error:
	/* Free resources */
	target_free_working_area(target, ssd_config);
	target_free_working_area(target, init_algorithm);

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);

	return err;
}

static int spc582b_auto_probe(struct flash_bank *bank)
{
	struct spc582b_flash_bank *spc582b_info = bank->driver_priv;

	LOG_DEBUG("%s:%d %s()",
		__FILE__, __LINE__, __func__);

	if (spc582b_info->probed)
		return ERROR_OK;
	return spc582b_probe(bank);
}


static int get_spc582b_info(struct flash_bank *bank, struct command_invocation *cmd)
{
	LOG_DEBUG("%s:%d %s()",
		__FILE__, __LINE__, __func__);

	/* TODO: retrieve the right info */
	//snprintf(buf, buf_size, "SPC560B - Rev: xx");

	return ERROR_OK;
}


struct flash_driver spc582b_flash = {
	.name = "spc582b",
	.flash_bank_command = spc582b_flash_bank_command,
	.erase = spc582b_erase,
	.protect = spc582b_protect,
	.write = spc582b_write,
	.read = default_flash_read,
	.probe = spc582b_probe,
	.auto_probe = spc582b_auto_probe,
	.erase_check = default_flash_blank_check,
	.protect_check = spc582b_protect_check,
	.info = get_spc582b_info,
};
